driver-tests/bpelse/xsddatatypes/XSDDataTypesBpel/src/datetime/dateTimeTest.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="dateTimeTest" targetNamespace="http://j2ee.netbeans.org/wsdl/dateTimeTest"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/dateTimeTest" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns0="http://xml.netbeans.org/schema/xmlSchema">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/dateTimeTest">
            <xsd:import namespace="http://xml.netbeans.org/schema/xmlSchema" schemaLocation="xmlSchema.xsd"/>
        </xsd:schema>
    </types>
    <message name="dateTimeTestOperationRequest">
        <part name="datePart" type="xsd:date"/>
        <part name="dateTimePart" type="xsd:dateTime"/>
        <part name="timePart" type="xsd:time"/>
    </message>
    <message name="dateTimeTestOperationResponse">
        <part name="datePart" type="xsd:date"/>
        <part name="dateTimePart" type="xsd:dateTime"/>
        <part name="timePart" type="xsd:time"/>
        <part name="testQueryExpressionPart" element="ns0:newElement"/>
    </message>
    <portType name="dateTimeTestPortType">
        <operation name="dateTimeTestOperation">
            <input name="input1" message="tns:dateTimeTestOperationRequest"/>
            <output name="output1" message="tns:dateTimeTestOperationResponse"/>
        </operation>
    </portType>
    <binding name="dateTimeTestBinding" type="tns:dateTimeTestPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="dateTimeTestOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/dateTimeTest"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/dateTimeTest"/>
            </output>
        </operation>
    </binding>
    <service name="dateTimeTestService">
        <port name="dateTimeTestPort" binding="tns:dateTimeTestBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/dateTimeTestService/dateTimeTestPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="dateTimeTest">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="dateTimeTestPortTypeRole" portType="tns:dateTimeTestPortType"/>
    </plnk:partnerLinkType>
</definitions>
