driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/dateTimeTest1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://j2ee.netbeans.org/wsdl/dateTimeTest">
  <soapenv:Body>
    <dat:dateTimeTestOperation>
      <datePart>2008-09-28</datePart>
      <dateTimePart>2014-09-18T16:18:33</dateTimePart>
      <timePart>10:27:14-07:00</timePart>
      <inputStringPart>UseInputMessageValues_Assign_Into_XSDVariables</inputStringPart>      
    </dat:dateTimeTestOperation>
  </soapenv:Body>
</soapenv:Envelope>